In [45]:
import numpy as np
import pandas as pd

In [46]:
marks=pd.Series([30,35,40],index=["python","DBMS","DSA"])

In [47]:
marks

python    30
DBMS      35
DSA       40
dtype: int64

In [48]:
d={"name":'smit',"gmail":'smit@gmail.com',"address":'vadodara'}

In [49]:
student=pd.Series(d)

In [50]:
student

name                 smit
gmail      smit@gmail.com
address          vadodara
dtype: object

In [51]:
student.keys()

Index(['name', 'gmail', 'address'], dtype='object')

In [52]:
student.values

array(['smit', 'smit@gmail.com', 'vadodara'], dtype=object)

In [53]:
marks=np.random.randint(0,100,(3,3))

In [54]:
marks

array([[30, 70, 26],
       [90, 84, 80],
       [94, 89, 77]])

In [55]:
Result=pd.DataFrame(marks,index=['siya','riya','meena'],columns=["python","DSA","DBMS"])
Result

       python  DSA  DBMS
siya       30   70    26
riya       90   84    80
meena      94   89    77

In [56]:
Result['python']

siya     30
riya     90
meena    94
Name: python, dtype: int32

In [57]:
Result['DBMS']

siya     26
riya     80
meena    77
Name: DBMS, dtype: int32

In [58]:
Result['DSA']

siya     70
riya     84
meena    89
Name: DSA, dtype: int32

In [59]:
Result.loc['siya']

python    30
DSA       70
DBMS      26
Name: siya, dtype: int32

In [60]:
Result.loc[['siya','riya','meena']]

       python  DSA  DBMS
siya       30   70    26
riya       90   84    80
meena      94   89    77

In [61]:
Result['total']=Result['python']+Result['DSA']+Result['DBMS']
Result

       python  DSA  DBMS  total
siya       30   70    26    126
riya       90   84    80    254
meena      94   89    77    260

In [62]:
Result['percentage']=Result['total']/3
Result

       python  DSA  DBMS  total  percentage
siya       30   70    26    126   42.000000
riya       90   84    80    254   84.666667
meena      94   89    77    260   86.666667

In [63]:
Result.drop('total',axis=1)

       python  DSA  DBMS  percentage
siya       30   70    26   42.000000
riya       90   84    80   84.666667
meena      94   89    77   86.666667

In [64]:
Result.drop('python',axis=1,inplace=True)

In [65]:
Result

       DSA  DBMS  total  percentage
siya    70    26    126   42.000000
riya    84    80    254   84.666667
meena   89    77    260   86.666667

In [66]:
Result.loc['siya']
Result

       DSA  DBMS  total  percentage
siya    70    26    126   42.000000
riya    84    80    254   84.666667
meena   89    77    260   86.666667

In [67]:
Result.drop('riya',axis=0)

       DSA  DBMS  total  percentage
siya    70    26    126   42.000000
meena   89    77    260   86.666667

In [68]:
Result.describe()

             DSA       DBMS       total  percentage
count   3.000000   3.000000    3.000000    3.000000
mean   81.000000  61.000000  213.333333   71.111111
std     9.848858  30.347982   75.692360   25.230787
min    70.000000  26.000000  126.000000   42.000000
25%    77.000000  51.500000  190.000000   63.333333
50%    84.000000  77.000000  254.000000   84.666667
75%    86.500000  78.500000  257.000000   85.666667
max    89.000000  80.000000  260.000000   86.666667

In [69]:
Result.head()

       DSA  DBMS  total  percentage
siya    70    26    126   42.000000
riya    84    80    254   84.666667
meena   89    77    260   86.666667

In [70]:
Result.head(2)

      DSA  DBMS  total  percentage
siya   70    26    126   42.000000
riya   84    80    254   84.666667

In [71]:
Result.tail()

       DSA  DBMS  total  percentage
siya    70    26    126   42.000000
riya    84    80    254   84.666667
meena   89    77    260   86.666667

In [72]:
Result

       DSA  DBMS  total  percentage
siya    70    26    126   42.000000
riya    84    80    254   84.666667
meena   89    77    260   86.666667

In [73]:
Result.iloc[[1],[1]]

      DBMS
riya    80

In [74]:
import pandas as pd
import numpy as np

In [75]:
Result['python']<40
Result

KeyError: 'python'

In [101]:
Result.loc[Result['python']<40,'python']=41
Result

KeyError: 'python'

In [77]:
Result=[Result+20]

In [78]:
Result.add(20)

AttributeError: 'list' object has no attribute 'add'

In [79]:
Result>100

TypeError: '>' not supported between instances of 'list' and 'int'

In [80]:
Result[(Result['DBMS']>60) & (Result['DSA']>45)]

TypeError: list indices must be integers or slices, not str

In [81]:
Result

[       DSA  DBMS  total  percentage
 siya    90    46    146   62.000000
 riya   104   100    274  104.666667
 meena  109    97    280  106.666667]

In [82]:
Result[Result.index.str.startswith('s')]

AttributeError: 'builtin_function_or_method' object has no attribute 'str'

In [83]:
Result[Result.index.str.endswith('a')]

AttributeError: 'builtin_function_or_method' object has no attribute 'str'

In [84]:
Result

[       DSA  DBMS  total  percentage
 siya    90    46    146   62.000000
 riya   104   100    274  104.666667
 meena  109    97    280  106.666667]

In [85]:
Result['Result']=np.where(Result['percentage']<40,"Fail","Pass")
Result

TypeError: list indices must be integers or slices, not str

In [93]:
import numpy as np
import pandas as pd

In [96]:
Result=pd.read_csv("C:/Users/smit7/Downloads/New folder/datasets/Salaries.csv")

C:\Users\smit7\AppData\Local\Temp\ipykernel_2832\103887700.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  Result=pd.read_csv("C:/Users/smit7/Downloads/New folder/datasets/Salaries.csv")

In [97]:
Result.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [100]:
Result=Result.replace('Not provided',np.nan)

In [99]:
Result["BasePay"].mean()

TypeError: unsupported operand type(s) for +: 'float' and 'str'